---
kind: enumMember
id: F:Autodesk.Revit.DB.FamilyInstanceReferenceType.NotAReference
enum: Autodesk.Revit.DB.FamilyInstanceReferenceType
source: html/ab424c61-4b80-9dcd-3f9a-7b35fa670edf.htm
---
# Autodesk.Revit.DB.FamilyInstanceReferenceType.NotAReference

This value is returned from FamilyInstance::getReferenceType if the reference does not correspond to any reference plane
 or reference line in the family.